vesselCarryover/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../caseGlobalVariables"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 -.1 0);
        value           uniform (0 10 0);
    }

/*    inlet*/
/*    {*/
/*        type            uniformFixedValue;*/
/*		uniformValue  table*/
/*		(*/
/*			( 0 (0 0 -56))*/
/*			( 2 (0 0 -75 ))*/
/*		);      */
/*    }*/
    
    inlet
    {
        type            cylindricalInletVelocity;
        axis            (0 0 -1);
        origin          (0 0 0);
        axialVelocity   $UInlet;
        rpm             0;
        radialVelocity  0;
        value           uniform (0 0 0);
    }
    
    outletSlurry
    {
        type            fixedValue;
		value           uniform ($UOutletSlurry 0 0);
    }

	".*"
	{
		type            fixedValue;
		value           uniform (0 0 0);
	}
   
}


// ************************************************************************* //
