vesselCarryover/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=$(getApplication)

# Meshing
runApplication blockMesh
runApplication surfaceFeatureExtract
#runApplication snappyHexMesh -overwrite
runApplication decomposePar -force
foamJob -wait -p snappyHexMesh -overwrite
runApplication reconstructParMesh -constant



#------------------------------------------------------------------------------
