vesselCarryover/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    vessel
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          253588;
        startFace       7496527;
    }
    inlet
    {
        type            patch;
        nFaces          306;
        startFace       7750115;
    }
    inletPipe
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          6608;
        startFace       7750421;
    }
    outlet
    {
        type            patch;
        nFaces          190;
        startFace       7757029;
    }
    outletSlurry
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          132;
        startFace       7757219;
    }
    block
    {
        type            wall;
        inGroups        
2
(
meshedWalls
wall
)
;
        nFaces          1540;
        startFace       7757351;
    }
)

// ************************************************************************* //
