vesselCarryover/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xm -3.41;
xp 3.1;
ym -3.1;
yp 3.1;
zm -2;
zp 12;

vertices
(
    ($xm $ym $zm)
    ($xp $ym $zm)
    ($xp $yp $zm)
    ($xm $yp $zm)
    ($xm $ym $zp)
    ($xp $ym $zp)
    ($xp $yp $zp)
    ($xm $yp $zp)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (53 51 115) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
